nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1171/fsl_pm_device.c
#endif                                     /* __CORTEX_M == 7 */

/*!
 * @brief State table for dual-core applications.
 */
const pm_device_option_t g_devicePMOption = {
    .states =
        {
            /* setpoint 0 */
            {
                .exitLatency = 6400UL, // From setpoint 0 standby suspend to setpoint 0 run mode.s
                /* In setpoint 0, following basic resources will be disabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2,
                 *  kResc_SYS_PLL1_DIV5, kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO,
                 * kResc_LPSR_DIG_LDO
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3C0000CUL,
                        .rescMask[1] = 0x1D8UL,
                    },
                /*
                 * In setpoint 0, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 1 */
            {
                .exitLatency = 4760UL, // From setpoint 1 standby suspend to setpoint 1 RUN.
                /*
                 * In setpoint 1, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO,
                 *  kResc_LPSR_DIG_LDO
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xCUL,
                        .rescMask[1] = 0x198UL,
                    },
                /*
                 * In setpoint 1, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 2 */
            {
                .exitLatency = 4760UL,
                /*
                 * In setpoint 2, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xCUL,
                        .rescMask[1] = 0x188UL,
                    },
                /*
                 * In setpoint 2, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 3 */
            {
                .exitLatency = 6400UL,
                /*
                 * In setpoint 2, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xCUL,
                        .rescMask[1] = 0x188UL,
                    },
                /*
                 * In setpoint 3, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 4 */
            {
                .exitLatency = 6400UL,
                /*
                 * In setpoint 4, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2,
                 *  kResc_SYS_PLL1_DIV5, kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3C0000CUL,
                        .rescMask[1] = 0x1C8UL,
                    },
                /*
                 * In setpoint 4, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 5 */
            {
                .exitLatency = 6960UL,
                /*
                 * In setpoint 5, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_ARM_PLL, kResc_ARM_PLL_CLK, kResc_SYS_PLL1,
                 *  kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5, kResc_FBB_M7, kResc_RBB_SOC,
                 *  kResc_RBB_LPSR, kResc_LPSR_ANA_LDO, kResc_LPSR_DIG_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3C0018CUL,
                        .rescMask[1] = 0x1D8UL,
                    },
                /*
                 * In setpoint 5, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 6 */
            {
                .exitLatency = 6400UL,
                /*
                 * In setpoint 6, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_ARM_PLL, kResc_ARM_PLL_CLK, kResc_SYS_PLL1,
                 *  kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5, kResc_FBB_M7, kResc_RBB_SOC,
                 *  kResc_RBB_LPSR, kResc_LPSR_ANA_LDO, kResc_LPSR_DIG_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3C0018CUL,
                        .rescMask[1] = 0x1D8UL,
                    },
                /*
                 * In setpoint 6, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 7 */
            {
                .exitLatency = 6400UL,
                /*
                 * In setpoint 7, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 * kResc_VIDEO_PLL_CLK，kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO,
                 * kResc_LPSR_DIG_LDO, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3FFFFFECUL,
                        .rescMask[1] = 0x5D8UL,
                    },
                /*
                 * In setpoint 7, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 8 */
            {
                .exitLatency = 64UL,
                /*
                 * In setpoint 8, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_LPSR_ANA_LDO, kResc_LPSR_DIG_LDO, kResc_PLL_LDO
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3FFFFFECUL,
                        .rescMask[1] = 0x458UL,
                    },
                /*
                 * In setpoint 8, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 9 */
            {
                .exitLatency = 6400UL,
                /*
                 * In setpoint 9, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 * kResc_VIDEO_PLL_CLK，kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_LPSR_ANA_LDO,
                 * kResc_LPSR_DIG_LDO, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3FFFFFECUL,
                        .rescMask[1] = 0x5D8UL,
                    },
                /*
                 * In setpoint 9, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 10 */
            {
                .exitLatency = 6740UL,
                /*
                 * In setpoint 10, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_LPSR_ANA_LDO, kResc_LPSR_DIG_LDO, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0x3FFFFFECUL,
                        .rescMask[1] = 0x458UL,
                    },
                /*
                 * In setpoint 10, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 11 */
            {
                .exitLatency = 6740UL,
                /*
                 * In setpoint 11, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_DCDC, kResc_MEGA_MIX,
                 *  kResc_DISPLAY_MIX, kResc_WAKEUP_MIX, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xFFFFFFECUL,
                        .rescMask[1] = 0x5C5UL,
                    },
                /*
                 * In setpoint 11, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 12 */
            {
                .exitLatency = 6740UL,
                /*
                 * In setpoint 12, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_DCDC, kResc_MEGA_MIX,
                 *  kResc_DISPLAY_MIX, kResc_WAKEUP_MIX, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xFFFFFFECUL,
                        .rescMask[1] = 0x5C5UL,
                    },
                /*
                 * In setpoint 12, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 13 */
            {
                .exitLatency = 6740UL,
                /*
                 * In setpoint 13, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_DCDC, kResc_MEGA_MIX,
                 *  kResc_DISPLAY_MIX, kResc_WAKEUP_MIX, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xFFFFFFECUL,
                        .rescMask[1] = 0x5C5UL,
                    },
                /*
                 * In setpoint 13, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 14 */
            {
                .exitLatency = 6740UL,
                /*
                 * In setpoint 14, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_RBB_SOC, kResc_RBB_LPSR, kResc_DCDC, kResc_MEGA_MIX,
                 *  kResc_DISPLAY_MIX, kResc_WAKEUP_MIX, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xFFFFFFECUL,
                        .rescMask[1] = 0x5C5UL,
                    },
                /*
                 * In setpoint 14, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* setpoint 15 */
            {
                .exitLatency = 8000UL,
                /*
                 * In setpoint 15, following basic resources will be diabled:
                 *  kResc_OSC_RC_48M, kResc_OSC_RC_48M_DIV2, kResc_OSC_24M, kResc_OSC_24M_CLK, kResc_ARM_PLL,
                 *  kResc_ARM_PLL_CLK, kResc_SYS_PLL1, kResc_SYS_PLL1_CLK, kResc_SYS_PLL1_DIV2, kResc_SYS_PLL1_DIV5,
                 *  kResc_SYS_PLL2, kResc_SYS_PLL2_CLK, kResc_SYS_PLL2_PFD0, kResc_SYS_PLL2_PFD1, kResc_SYS_PLL2_PFD2,
                 *  kResc_SYS_PLL2_PFD3 kResc_SYS_PLL3, kResc_SYS_PLL3_CLK, kResc_SYS_PLL3_PFD0, kResc_SYS_PLL3_PFD1,
                 *  kResc_SYS_PLL3_PFD2, kResc_SYS_PLL3_PFD3, kResc_AUDIO_PLL, kResc_AUDIO_PLL_CLK, kResc_VIDEO_PLL,
                 *  kResc_VIDEO_PLL_CLK, kResc_FBB_M7, kResc_RBB_SOC, kResc_DCDC, kResc_MEGA_MIX, kResc_OSC_RC_400M,
                 *  kResc_DISPLAY_MIX, kResc_WAKEUP_MIX, kResc_PLL_LDO.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xFFFFFFFCUL,
                        .rescMask[1] = 0x4C5UL,
                    },
                /*
                 * In setpoint 15, following basic resources are optional, application can set this to different
                 * operation modes: kResc_CPU_PLATFORM, kResc_STBY_REQ. Please note in default, CPU platform will
                 * powered off, and standby request will be assert.
                 */
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x1UL,
                        .rescMask[1] = 0x200UL,
                    },
            },
            /* SNVS */
            {
                .exitLatency = 8540UL, // From SNVS mode to ROM exit.
                /*
                 * In SNVS mode, none of basic resources are retained.
                 */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = 0xFFFFFFFFUL,
                        .rescMask[1] = 0x7FFUL,
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0] = 0x0UL,
                        .rescMask[1] = 0x0UL,
                    },
            },
        },
    .stateCount = 17U,
    .prepare    = RT1170_PreparePowerSetting,
    .enter      = RT1170_EnterPowerState,
    .clean      = NULL,
#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
    .manageWakeupSource = RT1170_ManageWakeupSource,
    .isWakeupSource     = RT1170_IsWakeupSource,
#endif /* (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) */
};

