nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1171/fsl_pm_device.c
#if __CORTEX_M == 4
/*!
 * @brief Configure setpoint mapping for CM4.
 */
static inline void RT1170_SetCore1PlatformSetpointMap(GPC_CPU_MODE_CTRL_Type *base)
{
    uint8_t i, j;
    uint32_t u32Tmp;

    uint32_t coreSetpointMap[17U][17U] = PM_RT1170_CM4_COMPATIBLE_SETPOINT_MAP;

    // Enable CPU sleep hold.
    GPC_CM_EnableCpuSleepHold(base, true);

    for (i = 1U; i < 17U; i++)
    {
        u32Tmp = 0UL;
        for (j = 1U; j < 17U; j++)
        {
            u32Tmp |= coreSetpointMap[i][j] << coreSetpointMap[0U][j];
        }
        GPC_CM_SetSetPointMapping(base, coreSetpointMap[i][0U], u32Tmp);
    }
}
#endif /* __CORTEX_M == 4 */

/*!
 * @brief Set CPU mode transition flow.
 */
static inline void RT1170_SetSleepTransitionFlow(void)
{
    gpc_tran_step_config_t transferStepConfig = {
        .stepCount  = 0UL,
        .cntMode    = kGPC_StepCounterDisableMode,
        .enableStep = false,
    };
    //    a. Disable Sleep SSARC control temporarily. TODO
    transferStepConfig.enableStep = false;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_SleepSsar, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_SleepSsar, &transferStepConfig);
#endif /* __CORTEX_M */
    //    b. User can determine if LPCG controlled by CPU mode or controlled by setpoint.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_SleepLpcg, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_SleepLpcg, &transferStepConfig);
#endif /* __CORTEX_M */
    //   c. Disable Sleep PLL control by cpu mode, it will be controlled by setpoint.
    transferStepConfig.enableStep = false;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_SleepPll, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_SleepPll, &transferStepConfig);
#endif /* __CORTEX_M */
    //    d. Enable Sleep ISO control by cpu mode, if CPU request to enter into suspend mode,
    //      related platform will be powered off.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_SleepIso, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_SleepIso, &transferStepConfig);
#endif /* __CORTEX_M */
    //    e. Enable Sleep RESET control.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_SleepReset, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_SleepReset, &transferStepConfig);
#endif /* __CORTEX_M */
    //    f. Enable Sleep POWER control, if CPU request to enter into suspend mode,
    //       related platform will be powered off.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_SleepPower, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_SleepPower, &transferStepConfig);
#endif /* __CORTEX_M */
    //    g. Enable Wakeup POWER control.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_WakeupPower, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_WakeupPower, &transferStepConfig);
#endif /* __CORTEX_M */
    //    h. Enable Wakeup RESET control.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_WakeupReset, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_WakeupReset, &transferStepConfig);
#endif /* __CORTEX_M */
    //    i. Enable Wakeup ISO control.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_WakeupIso, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_WakeupIso, &transferStepConfig);
#endif /* __CORTEX_M */
    //    j. Disable Wakeup PLL control by cpu mode, it will be controlled by setpoint.
    transferStepConfig.enableStep = false;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_WakeupPll, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_WakeupPll, &transferStepConfig);
#endif /* __CORTEX_M */
    //    k. Enable LPCG controlled by CPU mode.
    transferStepConfig.enableStep = true;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_WakeupLpcg, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_WakeupLpcg, &transferStepConfig);
#endif /* __CORTEX_M */
    //   l. Disable Wakeup SSARC control temporarily. TODO
    transferStepConfig.enableStep = false;
#if __CORTEX_M == 7
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_0, kGPC_CM_WakeupSsar, &transferStepConfig);
#elif __CORTEX_M == 4
    GPC_CM_ConfigCpuModeTransitionStep(GPC_CPU_MODE_CTRL_1, kGPC_CM_WakeupSsar, &transferStepConfig);
#endif /* __CORTEX_M */
}

static void RT1170_PreparePowerSetting(void)
{
#if __CORTEX_M == 7
    // 1. Control clock sources via setpoint.
    RT1170_SetClockSourcesControlBySetpoint();

    // 2. Control power domains via setpoint.
    RT1170_SetPowerDomainsControlBySetpoint();

    // 3. Control power supply via setpoint.
    RT1170_SetPowerSupplyControlBySetpoint();

    // 4. Control bandgap via GPC, CM7 is responsible for this.
    PMU_GPCEnableBandgap(ANADIG_PMU, PM_RT1170_BANDGAP_EN_SETPOINT_MAP);
    PMU_GPCEnableBandgapStandbyMode(ANADIG_PMU, PM_RT1170_BANDGAP_STANDBY_SETPOINT_MAP);
    PMU_SetBandgapControlMode(ANADIG_PMU, kPMU_GPCMode);

