nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT1171/fsl_pm_device.c
    // 5. Control body bias via GPC, CM7 is responsible for this.
    /* Check if FBB need to be enabled in OverDrive(OD) mode.
       Note: FUSE could not be read out if OTP memory is powered off.*/
    if (((OCOTP->FUSEN[7].FUSE & 0x10UL) >> 4UL) != 1UL)
    {
        PMU_GPCEnableBodyBias(kPMU_FBB_CM7, PM_RT1170_FBB_EN_SETPOINT_MAP);
    }
    else
    {
        PMU_GPCEnableBodyBias(kPMU_FBB_CM7, 0);
    }
    PMU_GPCEnableBodyBiasStandbyMode(kPMU_FBB_CM7, PM_RT1170_FBB_STANDBY_SETPOINT_MAP);
    PMU_SetBodyBiasControlMode(ANADIG_PMU, kPMU_FBB_CM7, kPMU_GPCMode);

    PMU_GPCEnableBodyBias(kPMU_RBB_SOC, PM_RT1170_RBB_SOC_EN_SETPOINT_MAP);
    PMU_GPCEnableBodyBiasStandbyMode(kPMU_RBB_SOC, PM_RT1170_RBB_SOC_STANDBY_SETPOINT_MAP);
    PMU_SetBodyBiasControlMode(ANADIG_PMU, kPMU_RBB_SOC, kPMU_GPCMode);

    PMU_GPCEnableBodyBias(kPMU_RBB_LPSR, PM_RT1170_RBB_LPSR_EN_SETPOINT_MAP);
    PMU_GPCEnableBodyBiasStandbyMode(kPMU_RBB_LPSR, PM_RT1170_RBB_LPSR_STANDBY_SETPOINT_MAP);
    PMU_SetBodyBiasControlMode(ANADIG_PMU, kPMU_RBB_LPSR, kPMU_GPCMode);

    // 6. Set setpoint mapping for CM7 platforms.
    RT1170_SetCore0PlatformSetpointMap(GPC_CPU_MODE_CTRL_0);

    // 7. Configure SRC
    RT1170_SetSRCControlMode();

    // 8. Set setpoint transfer steps, CM7 is responsible for this.
    RT1170_SetSetpointTransitionFlow();

    // 9. Set standby request steps.
    RT1170_SetStandbyTransitionFlow();

    // 10. Save vector offset register.
    IOMUXC_LPSR_GPR->GPR26 &= ~IOMUXC_LPSR_GPR_GPR26_CM7_INIT_VTOR_MASK;
    IOMUXC_LPSR_GPR->GPR26 |= IOMUXC_LPSR_GPR_GPR26_CM7_INIT_VTOR(PM_RT1170_VECTOR_TABLE >> 7);

    // 11. Power off cpu platform when domain enters suspend mode.
    PGMC_CPC_CORE_PowerOffByCpuPowerMode(PGMC_CPC0, kPGMC_SuspendMode);

    // 12. Miscellaneous settings.
    /* SW should write 1 to OCOTP->PDN bit 0 to shut off power to the OTP memory and avoid unnecessary power wasting.
       Note: FUSE could not be read out if OTP memory is powered off. */
    OCOTP->PDN |= OCOTP_PDN_PDN_MASK;
    IOMUXC_SNVS_GPR->GPR37 |= IOMUXC_SNVS_GPR_GPR37_SNVS_TAMPER_PUE_MASK;
    /* CM7 SLEEPING is sent to GPC to start sleep sequence */
    IOMUXC_GPR->GPR16 |= IOMUXC_GPR_GPR16_M7_GPC_SLEEP_SEL_MASK;
    /* CM4 SLEEPING is sent to GPC to start sleep sequence */
    IOMUXC_LPSR_GPR->GPR34 |= IOMUXC_LPSR_GPR_GPR34_M4_GPC_SLEEP_SEL_MASK;
#endif /* __CORTEX_M == 7 */

#if __CORTEX_M == 4
    // Set setpoint mapping for all core platforms.
    RT1170_SetCore1PlatformSetpointMap(GPC_CPU_MODE_CTRL_1);
    PGMC_CPC_CORE_PowerOffByCpuPowerMode(PGMC_CPC1, kPGMC_SuspendMode);
#endif

    // Set Sleep and WAKEUP steps.
    RT1170_SetSleepTransitionFlow();

    // Mask all wakeup interrupts by default for all platform.
    for (uint8_t i = 0U; i < 8U; i++)
    {
#if __CORTEX_M == 7
        GPC_CPU_MODE_CTRL_0->CM_IRQ_WAKEUP_MASK[i] = 0xFFFFFFFFUL;
#elif __CORTEX_M == 4
        GPC_CPU_MODE_CTRL_1->CM_IRQ_WAKEUP_MASK[i] = 0xFFFFFFFFUL;
#endif
    }

#if (defined(PM_PM_DUAL_CORE_USED) && (!PM_PM_DUAL_CORE_USED))
    // 12. In single core application, force unused core request to standby mode.
    GPC_STBY_ForceCoreRequestStandbyMode(GPC_STBY_CTRL, CURRENT_STBY_CORE_NAME);
#endif // PM_PM_DUAL_CORE_USED

    // TODO: Cpu mode trigger data saving by SSARC.
}

static void RT1170_EnterPowerState(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    assert(pSoftRescMask != NULL);
    assert(pSysRescGroup != NULL);

    gpc_cpu_mode_t nextCpuMode = kGPC_SuspendMode;

    if (stateIndex == 16U)
    {
        // SNVS Mode, in this mode, only SNVS MIX is powered on, other domains are powered off
        SNVS->LPCR |= SNVS_LPCR_TOP_MASK;
    }
    else
    {
        // 1. Get CPU mode to transit based on application request.
        if ((pSoftRescMask->rescMask[0] & (1UL << kResc_CPU_PLATFORM)) != 0UL)
        {
            switch (RT1170_FindOperateMode((uint32_t)kResc_CPU_PLATFORM, pSysRescGroup))
            {
                case PM_RESOURCE_FULL_ON:
                    // In case of application request PM_RESC_CORE_DOMAIN_RUN.
                    nextCpuMode = kGPC_RunMode;
                    break;
                case PM_RESOURCE_PARTABLE_ON1:
                    // In case of application request PM_RESC_CORE_DOMAIN_WAIT.
                    nextCpuMode = kGPC_WaitMode;
                    break;
                case PM_RESOURCE_PARTABLE_ON2:
                    // In case of application request PM_RESC_CORE_DOMAIN_STOP.
                    nextCpuMode = kGPC_StopMode;
                    break;
                case PM_RESOURCE_OFF:
                    // In case of application request PM_RESC_CORE_DOMAIN_SUSPEND.
                    nextCpuMode = kGPC_SuspendMode;
                    break;
                default:
                    // To avoid violation of MISRA C-2012 Rule 15.7
                    assert(false);
                    break;
            }
        }
        else
        {
            // In case of no application request, CPU platform will be powered off.
            nextCpuMode = kGPC_SuspendMode;
        }
        GPC_CM_SetNextCpuMode(CURRENT_GPC_INSTANCE, nextCpuMode);

        // 2. Target setpoint is stateIndex, wakeup setpoint is current setpoint.
        if (nextCpuMode == kGPC_RunMode)
        {
            // Only need to switch setpoint.
            GPC_CM_RequestRunModeSetPointTransition(CURRENT_GPC_INSTANCE, stateIndex);
        }
        else
        {
            // Set to target setpoint in low power state, and then switch to previous setpoint.
            // For example, if current setpoint is 0, target setpoint is 10, system will switch into setpoint 10 when
            // CPU is low power mode and after waking from low power mode, system will back to setpoint 0 automatically.
            GPC_CM_RequestSleepModeSetPointTransition(CURRENT_GPC_INSTANCE, stateIndex, stateIndex,
                                                      kGPC_CM_RequestPreviousSetpoint);
        }

        if (nextCpuMode != kGPC_RunMode)
        {
            // 3. Request standby or not based on application request, if nextCPU mode is Run Mode, it is no need to
            //    request standby. In default, standby request will be assert to get lowest power consumption, and
            //    application can request to de-assert standby request to get better performance by set
            //    PM_STANDBY_REQ_OFF.

            // Clear all standby request before setting new standby request.
            GPC_CM_ClearStandbyModeRequest(CURRENT_GPC_INSTANCE, kGPC_WaitMode);
            GPC_CM_ClearStandbyModeRequest(CURRENT_GPC_INSTANCE, kGPC_StopMode);
            GPC_CM_ClearStandbyModeRequest(CURRENT_GPC_INSTANCE, kGPC_SuspendMode);

            if (RT1170_FindOperateMode((uint32_t)kResc_STBY_REQ, pSysRescGroup) != PM_RESOURCE_FULL_ON)
            {
                // If not request to de-assert standby request, assert standby request when CPU entering selected CPU
                // mode.
                GPC_CM_RequestStandbyMode(CURRENT_GPC_INSTANCE, nextCpuMode);
            }

            if (nextCpuMode == kGPC_WaitMode)
            {
                // Clear the SLEEPDEEP bit to go into sleep mode (WAIT)
                SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
            }
            else
            {
                // Set the SLEEPDEEP bit to go into deep sleep mode (STOP and SUSPEND)
                SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
            }
            __DSB();
            __ISB();
            __WFI();
        }
    }
}

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t RT1170_ManageWakeupSource(pm_wakeup_source_t *ws, bool enable)
{
    uint32_t irqId = 0UL;
    irqId          = PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);
    if (enable)
    {
        // Enabled selected wakeup source, including enable it in NVIC and GPC.
        (void)EnableIRQ((IRQn_Type)irqId);
        GPC_CM_EnableIrqWakeup(CURRENT_GPC_INSTANCE, irqId, true);
    }
    else
    {
        // Disable selected wakeup source, including disable it in NVIC and GPC.
        (void)DisableIRQ((IRQn_Type)irqId);
        GPC_CM_EnableIrqWakeup(CURRENT_GPC_INSTANCE, irqId, false);
    }

    return kStatus_Success;
}

static bool RT1170_IsWakeupSource(pm_wakeup_source_t *ws)
{
    uint32_t irqId = 0UL;
    bool ret       = false;

    irqId = PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);
    ret   = GPC_CM_GetIrqWakeupStatus(CURRENT_GPC_INSTANCE, irqId);

    return ret;
}
#endif /* (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) */
